# Taps
tap 'homebrew/bundle'
tap 'heroku/brew' 

# Install CLI Tools
## Shell Utilities
brew 'coreutils'
brew 'findutils'
brew 'autojump'
brew 'zsh'
brew 'zsh-completions'
brew 'tmux'
brew 'jq'
brew 'q'
brew 'docker-compose'
brew 'ack'

## Network Utilities
brew 'htop'
brew 'wget'

## System Utilities
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'rsync'

## Dev Utilities
brew 'git'
brew 'nvm'
brew 'node'
brew 'svn'
brew 'haskell-stack'

# Mac Apps
## Communication
cask 'wechat'
cask 'slack'
cask 'skype'
cask 'zoomus'

## Productivity
cask 'docker'
cask 'google-chrome'
cask 'clipy'
cask 'cheatsheet'
cask 'shiftit'
cask 'notion'

## System
cask 'the-unarchiver'
cask 'google-backup-and-sync'

## Editor
cask 'visual-studio-code'
brew 'neovim'
brew 'vim'

## Development
cask 'firefox'
cask 'iterm2'
cask 'mactex'

## Graphics
cask 'adobe-creative-cloud'
cask 'figma'

## Media
cask 'iina'
cask 'spotify'
cask 'calibre'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

